// Задача 47. Задайте двумерный массив размером m×n, заполненный случайными вещественными числами.
// m = 3, n = 4.
// 0,5 7 -2 -0,2
// 1 -3,3 8 -9,9
// 8 7,8 -7,1 9

Console.WriteLine("Введите длину строки массива");
m = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите высоту столбца массива");